spec/fixtures/vcr_cassettes/Transaction/Class_Methods/_charge_by_invoice_ids/with_a_failing_purchase/with_a_purchase_that_raise_an_error/should_set_transaction_and_invoices_to_failed_state.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=S41O9T8S&CARDNO=4111111111111111&CN=John+Doe+Huber&CVC=111&ECI=7&ED=0914&EMAIL=email9%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PARAMPLUS=CHECK_CC_USER_ID%3D1131&PSPID=jilion&PSWD=WWQMNC89&SHASign=570E86962E256FFA64D29B5C30691041470C8F84965D712D79D973F6EF7B242B8B5B302FA05070D2AA14FFA64146813488B7671E485A9F87F706A46D2D1C1B54&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=949ecfa3e147c6cce74da8232f0798&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:21 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:19 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868296882_1718552;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"949ecfa3e147c6cce74da8232f0798\"\r\nPAYID=\"23938615\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"S41O9T8S\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:21 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938615&PSPID=jilion&PSWD=WWQMNC89&SHASign=C0C835B416C761034A5B46ED61C00C9068DB31DEF91E361330ECBE9FEA7C35F81DAE93FC9F40C9356DD0C7ED3F750ECB68DEF6C634CE43F0039701957CA93041&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:21 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:21 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869350207_1718552;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"949ecfa3e147c6cce74da8232f0798\"\r\nPAYID=\"23938615\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:21 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938615&PSPID=jilion&PSWD=WWQMNC89&SHASign=C0C835B416C761034A5B46ED61C00C9068DB31DEF91E361330ECBE9FEA7C35F81DAE93FC9F40C9356DD0C7ED3F750ECB68DEF6C634CE43F0039701957CA93041&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:22 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:21 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868296904_1718552;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"949ecfa3e147c6cce74da8232f0798\"\r\nPAYID=\"23938615\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:22 GMT
recorded_with: VCR 2.6.0
