spec/fixtures/vcr_cassettes/Transaction/Class_Methods/_charge_by_invoice_ids/with_a_succeeding_purchase/alias/sets_transaction_and_invoices_to_paid_state.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=EVVGWYVI&CARDNO=4111111111111111&CN=John+Doe+Huber&CVC=111&ECI=7&ED=0914&EMAIL=email4%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PARAMPLUS=CHECK_CC_USER_ID%3D1126&PSPID=jilion&PSWD=WWQMNC89&SHASign=49320E8743FBFC187120F0B6CF541A471071027890E5FB88B4EC1FA1389574466ABDC84D27C7817EAD4AB114A619DC3AA92D75AB02DB44A0D2D46C350C1E34FE&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=2b717b42b3ef4f1a667253aef38c8f&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:05 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:04 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869349431_1718536;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"2b717b42b3ef4f1a667253aef38c8f\"\r\nPAYID=\"23938609\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"EVVGWYVI\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:05 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938609&PSPID=jilion&PSWD=WWQMNC89&SHASign=291EBE70CB3C5620BB8747DA5102FC0F9439BA26378E28FA339859D3FC2ACFAC80D71D17FB5A3F8BB4A727C26B875472944944A8AFD9505C66A4FF4DE08107D1&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:06 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:06 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868296168_1718537;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"2b717b42b3ef4f1a667253aef38c8f\"\r\nPAYID=\"23938609\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:06 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938609&PSPID=jilion&PSWD=WWQMNC89&SHASign=291EBE70CB3C5620BB8747DA5102FC0F9439BA26378E28FA339859D3FC2ACFAC80D71D17FB5A3F8BB4A727C26B875472944944A8AFD9505C66A4FF4DE08107D1&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:06 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:06 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868296186_1718537;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"2b717b42b3ef4f1a667253aef38c8f\"\r\nPAYID=\"23938609\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:06 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=EVVGWYVI&COM=%23lrpt81pz&ECI=9&EMAIL=email4%40user.com&Operation=SAL&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PSPID=jilion&PSWD=WWQMNC89&SHASign=67851F24FE483892E1772CE2D9B0833708757B686018F4CDCF49AD1F54A3613592CFE9EE7CE8DB4EAE36B8622EE5CBA5A119A84EAFEE859221922FFADC8D203E&USERID=sublime&amount=9999&currency=USD&orderID=prtbosz6s2pq4u4i85mk94qp7jhwyi&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:27:08 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:26:06 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868296268_1718539;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"prtbosz6s2pq4u4i85mk94qp7jhwyi\"\r\nPAYID=\"23938610\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"9\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"9\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"99.99\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"EVVGWYVI\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:27:08 GMT
recorded_with: VCR 2.6.0
