spec/fixtures/vcr_cassettes/Transaction/Class_Methods/_charge_invoices_by_user_id/delays_invoice_charging_for_failed_open_invoices.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=MIZG7REQ&CARDNO=4111111111111111&CN=John+Doe+Huber&CVC=111&ECI=7&ED=0914&EMAIL=email38%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PARAMPLUS=CHECK_CC_USER_ID%3D1112&PSPID=jilion&PSWD=WWQMNC89&SHASign=71D5D8E8181F9EF6A0169A01C76074C39454D001AC30344B1631AECA4D5DFF085A051FB1DFD265D9B18F6E39BBB8DF161DF6297A23CFE387D599FE56B831B383&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=ba4cac2bdb524f2ec942d963da83c9&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:25 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:24 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291330_1718436;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"ba4cac2bdb524f2ec942d963da83c9\"\r\nPAYID=\"23938561\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"MIZG7REQ\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:25 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938561&PSPID=jilion&PSWD=WWQMNC89&SHASign=15CFFE003F45583513C6E65706CFCAE3AE645A00EEC3EE237172D3752A364C8F5C7E5E32B9EC77A6D63941F679C29C6C6206101376CBA6B6773A56FE2DF8CA00&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:25 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:25 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291350_1718436;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"ba4cac2bdb524f2ec942d963da83c9\"\r\nPAYID=\"23938561\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:26 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938561&PSPID=jilion&PSWD=WWQMNC89&SHASign=15CFFE003F45583513C6E65706CFCAE3AE645A00EEC3EE237172D3752A364C8F5C7E5E32B9EC77A6D63941F679C29C6C6206101376CBA6B6773A56FE2DF8CA00&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:26 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:26 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869344561_1718437;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"ba4cac2bdb524f2ec942d963da83c9\"\r\nPAYID=\"23938561\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:26 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=9HRP0A84&CARDNO=4111111111111111&CN=John+Doe+Huber&CVC=111&ECI=7&ED=0914&EMAIL=email39%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PARAMPLUS=CHECK_CC_USER_ID%3D1113&PSPID=jilion&PSWD=WWQMNC89&SHASign=A566CAB027E78370D1A9A74B1F3CABCBBFC04ABF86330823AFB2E334B0B2324606DE9009F5065788380AAA0933EECB58CE209E0A94823E938D071C27C0FBB34B&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=ba6f8103d6c5cfdfd2316f41c2edc0&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:28 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:26 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291450_1718438;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"ba6f8103d6c5cfdfd2316f41c2edc0\"\r\nPAYID=\"23938562\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"9HRP0A84\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:28 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938562&PSPID=jilion&PSWD=WWQMNC89&SHASign=081B2B69BF9C38C6CD64F5C94919025DDB37197D2F5277F2983242E4E37BB7473CC2C43D9DF4942FF0C59A9AD831560CFB4736EB1DF70F1BA1ED92C9A369E4FF&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:28 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:28 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291468_1718439;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"ba6f8103d6c5cfdfd2316f41c2edc0\"\r\nPAYID=\"23938562\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:28 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938562&PSPID=jilion&PSWD=WWQMNC89&SHASign=081B2B69BF9C38C6CD64F5C94919025DDB37197D2F5277F2983242E4E37BB7473CC2C43D9DF4942FF0C59A9AD831560CFB4736EB1DF70F1BA1ED92C9A369E4FF&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:28 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:28 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291484_1718439;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"ba6f8103d6c5cfdfd2316f41c2edc0\"\r\nPAYID=\"23938562\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:28 GMT
recorded_with: VCR 2.6.0
